다음은 Ackermann function을 나타낸 프로시저이다.

(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))
아래 식의 값은 무엇인가?

(A 1 10)
    (A 0 (A 1 9))
    (A 0 (A 0 (A 1 8)))
    (A 0 (A 0 (A 0 (A 1 7))))
                  .
                  .
                  .
    (A 0 (A 0 ....A( 1 1))..)
    (A 0 (A 0....A(0 2)..))
                  .
                  . 
    2^10 = 1024
  

(A 2 4)
    (A 1 (A 2 3))
    (A 1 (A 1 (A 2 2)))
    (A 1 (A 1 (A 1 (A 2 1))))
    (A 1 (A 1 (A 1 2)))
    (A 1 (A 1 (A 0 (A 1 1))))
    (A 1 (A 1 (A 0 2)))
    (A 1 (A 1 4))
    (A 1 (A 0 (A 1 3)))
    (A 1 (A 0 (A 0 (A 1 2))))
    (A 1 (A 0 (A 0 (A 0 (A 1 1)))))
    (A 1 (A 0 (A 0 (A 0 2))))
    (A 1 (A 0 (A 0 4)))
    (A 1 (A 0 8))
    (A 1 16)
    =2^16

(A 3 3)
    (A 2 (A 3 2))
    (A 2 (A 2 (A 3 1))
    (A 2 (A 2 2))
    (A 2 (A 1 (A 2 1)))
    (A 2 (A 1 2))
    (A 2 (A 0 (A 1 1)))
    (A 2 (A 0 2))
    (A 2 4)

다음 프로시저가 정의되어 있다고 하자.
(define (f n) (A 0 n))
(define (g n) (A 1 n))
(define (h n) (A 2 n))
(define (k n) (* 5 n n))
0보다 큰 정수 n이 있을 때 f, g, h프로시저의 기능을 수학으로 정의해 보라.
보기를 들어, (k n)은 5*n^2 을 나타낸다.

(A 0 n) = 2*n
(A 1 n) = 2^n 
(A 2 n)을 An수열이라하면
                 A1= 2,
(n!=1일때)An = 2^(An-1)